linux/tools/top.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-05 一 20:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>top</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">top</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3902151">1. 概述</a></li>
<li><a href="#orgc4a28ba">2. 使用</a></li>
<li><a href="#orgdc9c760">3. 视图</a></li>
<li><a href="#orgb8e1239">4. 交互命令</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3902151" class="outline-2">
<h2 id="org3902151"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
该命令用于显示进程的实时状态。
</p>
</div>
</div>

<div id="outline-container-orgc4a28ba" class="outline-2">
<h2 id="orgc4a28ba"><span class="section-number-2">2</span> 使用</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>-p</code> 指定进程 ID，可指定多个。</li>
<li><code>-b</code> 批处理模式启动。</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc9c760" class="outline-2">
<h2 id="orgdc9c760"><span class="section-number-2">3</span> 视图<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
top - 22:50:47 up  3:09,  1 user,  load average: 0.30, 0.46, 0.35
Tasks: 309 total,   1 running, 230 sleeping,   0 stopped,   0 zombie
%Cpu(s):  3.7 us,  1.3 sy,  0.0 ni, 94.2 id,  0.8 wa,  0.0 hi,  0.1 si,  0.0 st
KiB Mem : 16239164 total,  5903100 free,  5344076 used,  4991988 buff/cache
KiB Swap:        0 total,        0 free,        0 used.  9934060 avail Mem

PID USER      PR  NI    VIRT    RES    SHR S  %CPU %MEM     TIME+ COMMAND
</pre>


<p>
第一行，任务队列信息：
</p>
<ul class="org-ul">
<li>当前时间。</li>
<li>登录用户数量。</li>
<li>系统 1 分钟，5 分钟，15 分钟负载（load average）。load average 数据是每隔 5 秒钟检查一次活跃的进程数，然后按特定算法计算出的数值。如果这个数除以逻辑 CPU 的数量，结果高于 5 的时候就表明系统在超负荷运转了。</li>
</ul>

<p>
第二行，系统进程统计。
</p>

<p>
第三行，CPU 状态信息
</p>
<ul class="org-ul">
<li>us  用户空间占用 CPU 的百分比。</li>
<li>sy  内核空间占用 CPU 的百分比。</li>
<li>ni  改变过优先级的进程占用 CPU 的百分比。</li>
<li>id  空闲 CPU 百分比。</li>
<li>wa  IO 等待占用 CPU 的百分比。</li>
<li>hi  硬中断（Hardware IRQ）占用 CPU 的百分比。</li>
<li>si  软中断（Software Interrupts）占用 CPU 的百分比。</li>
<li>st  虚拟机占用百分比</li>
</ul>

<p>
第四行，内存状态：
</p>
<ul class="org-ul">
<li>total  物理内存总量。</li>
<li>free  空闲内存总量。</li>
<li>used  使用中的内存总量。</li>
<li>buffers  缓存的内存量。</li>
</ul>

<p>
第五行，swap 交换分区信息：
</p>
<ul class="org-ul">
<li>total  交换区总量</li>
<li>free  空闲交换区总量</li>
<li>used  使用的交换区总量</li>
<li>cached  缓冲的交换区总量</li>
</ul>

<p>
第七行以下：各进程（任务）的状态监控：
</p>
<ul class="org-ul">
<li>PID  进程 id。</li>
<li>USER  进程所有者。</li>
<li>PR  进程优先级。</li>
<li>NI  nice 值。负值表示高优先级，正值表示低优先级。</li>
<li>VIRT  进程使用的虚拟内存总量，单位 kb。VIRT=SWAP+RES。</li>
<li>RES  进程使用的、未被换出的物理内存大小，单位 kb。RES=CODE+DATA。</li>
<li>SHR  共享内存大小，单位 kb。</li>
<li>S  进程状态。D（不可中断的睡眠状态），R（运行），S（睡眠），T（跟踪/停止），Z（僵尸进程）。</li>
<li>% CPU  上次更新到现在的 CPU 时间占用百分比。</li>
<li>% MEM  进程使用的物理内存百分比。</li>
<li>TIME+  进程使用的 CPU 时间总计，精确到 1/100 秒。</li>
<li>COMMAND  进程名称（命令名 / 命令行）。</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8e1239" class="outline-2">
<h2 id="orgb8e1239"><span class="section-number-2">4</span> 交互命令</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>h 显示帮助。</li>
<li>f 调整要展示的列。</li>
<li>&lt;,&gt; 指定排序的列，默认是%CPU 排序。</li>
<li>x 高亮排序的列。配合&lt;，&gt;更容易展示。</li>
<li>c 切换显示完整命令行。</li>
<li>M 根据驻留内存排序。</li>
<li>P 根据 CPU 使用百分比大小进行排序。</li>
<li>V 树视图。</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://linux.cn/article-2352-1.html">https://linux.cn/article-2352-1.html</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-05 一 20:27</p>
<p class="validation"></p>
</div>
</body>
</html>
